[
  {
    "image": "https://i.ibb.co.com/LXDVyB3y/cb65e80c61f2e534ca47d11cd78fc5fd.jpg",
    "title": "Spotify: Music and Podcasts",
    "companyName": "Spotify AB",
    "id": 1,
    "description": "Listen to millions of songs, podcasts, and playlists for free. Stream and share music you love. Discover new artists, follow your favorite creators, and build custom playlists that suit every mood or occasion. Whether you're working out, relaxing, or commuting, Spotify offers music to match your vibe. Explore curated playlists, trending charts, and personalized recommendations. Switch between devices seamlessly and enjoy high-quality audio anytime, anywhere. Free users can access shuffle play, while premium subscribers enjoy ad-free listening, offline downloads, and unlimited skips. Spotify redefines how you experience audio entertainment, putting a world of sound right at your fingertips.",
    "size": 54,
    "reviews": 31500000,
    "ratingAvg": 4.5,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 21100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tMLCHTZ6/d29bf8695ef463592751391ce5bff134.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc",
    "id": 2,
    "description": "Listen to millions of songs, podcasts, and playlists for free. Stream and share music you love. Discover new artists, follow your favorite creators, and build custom playlists that suit every mood or occasion. Whether you're working out, relaxing, or commuting, Spotify offers music to match your vibe. Explore curated playlists, trending charts, and personalized recommendations. Switch between devices seamlessly and enjoy high-quality audio anytime, anywhere. Free users can access shuffle play, while premium subscribers enjoy ad-free listening, offline downloads, and unlimited skips. Spotify redefines how you experience audio entertainment, putting a world of sound right at your fingertips.",
    "size": 78,
    "reviews": 33000000,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 3500000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 20000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5hkJx18F/b83d053902adaaa700395ce0cd102dec.jpg",
    "title": "Instagram",
    "companyName": "Instagram",
    "id": 3,
    "description": "Instagram lets you capture, edit, and share your life’s moments with photos, videos, and reels. Connect with friends, family, and your favorite influencers from around the world. Explore trending content, discover new interests through hashtags, and engage with a global community. Share stories that disappear in 24 hours or go live to interact in real time. Use filters and creative tools to personalize your content. Instagram is also a platform for brands, creators, and businesses to reach audiences and grow. Whether for fun, inspiration, or staying informed, Instagram offers a dynamic space for self-expression and social discovery.",
    "size": 64,
    "reviews": 155000000,
    "ratingAvg": 4.4,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 4500000 },
      { "name": "2 star", "count": 2500000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 121000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5hwtCYKb/596d74fed827cf406cbd2a4f0d8f00b2.jpg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 4,
    "description": "Telegram is a cloud-based messaging app that prioritizes speed, security, and privacy. Chat with individuals or groups using text, voice, or video messages. Share large files of any type and create group chats with up to 200,000 members. With features like secret chats, self-destructing messages, and end-to-end encryption, Telegram ensures your communication stays private. You can also explore public channels and bots for news, tools, and entertainment. The app syncs across all devices and is completely free, with no ads. Ideal for both personal and professional use, Telegram combines modern messaging with powerful features and total user control.",
    "size": 41,
    "reviews": 12000000,
    "ratingAvg": 4.6,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 3000000 },
      { "name": "5 star", "count": 7500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5xgfgypH/1daf5b470804903c7fd44175e472aac9.jpg",
    "title": "Duolingo: Language Lessons",
    "companyName": "Duolingo",
    "id": 5,
    "description": "Duolingo makes learning languages fun, fast, and effective. With bite-sized lessons, interactive exercises, and engaging mini-games, users can learn over 30 languages including Spanish, French, German, and Japanese. The app uses gamification to motivate learning — earn points, unlock levels, and maintain streaks. Lessons are tailored to reading, writing, listening, and speaking skills. Friendly reminders keep you on track, and its adaptive learning system personalizes lessons to your skill level. Whether you're a beginner or brushing up, Duolingo offers a fun and efficient way to learn anytime, anywhere. Plus, it’s completely free with optional premium features for added perks.",
    "size": 35,
    "reviews": 13000000,
    "ratingAvg": 4.7,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 9400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/CpP5LQ05/156254cda1120f9204f7a08238b81721.jpg",
    "title": "Canva: Design, Photo & Video",
    "companyName": "Canva",
    "id": 6,
    "description": "Canva is a powerful yet easy-to-use design platform that lets anyone create stunning graphics, videos, presentations, and social media posts. With drag-and-drop simplicity, thousands of templates, and a vast library of images, fonts, icons, and music, you can bring your creative ideas to life effortlessly. Whether designing for work, school, or personal projects, Canva supports collaboration and customization. Create everything from business cards to Instagram stories and marketing materials without needing professional design skills. Canva also offers tools for photo editing and video creation. Accessible on both desktop and mobile, it's a go-to tool for creators and professionals alike.",
    "size": 56,
    "reviews": 12000000,
    "ratingAvg": 4.8,
    "downloads": 500000000,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 9300000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/hRfXdws2/7e34d649fea4c0a69a59d8857c7bd63f.jpg",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 7,
    "description": "Netflix offers unlimited access to a massive library of TV shows, movies, anime, documentaries, and original content from around the globe. Watch anytime, anywhere on your phone, tablet, or TV without interruptions from ads. Browse content based on genres, trends, or personalized recommendations. Download episodes and movies for offline viewing and enjoy high-definition playback. Netflix Originals, like Stranger Things and The Crown, provide unique stories you won’t find anywhere else. With content for every age group and mood, Netflix remains one of the most popular streaming services worldwide, redefining how people enjoy entertainment across all screens.",
    "size": 98,
    "reviews": 14000000,
    "ratingAvg": 4.3,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 7400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/V0SKTv3y/a8373b784593f4eafe2e69b0f519a594.jpg",
    "title": "TikTok",
    "companyName": "TikTok Pte. Ltd.",
    "id": 8,
    "description": "TikTok is the go-to platform for creating and discovering short videos that entertain, inform, and inspire. Join a global community where users express themselves through music, dance, comedy, education, and more. Its smart algorithm tailors content to your preferences, ensuring endless, personalized entertainment. Easily shoot, edit, and upload videos with effects, filters, and sounds. Participate in viral challenges, trends, and duets with other creators. Whether you're a content creator or a casual viewer, TikTok offers an engaging, fast-paced, and interactive experience that keeps you connected to global culture and creativity, one short video at a time.",
    "size": 90,
    "reviews": 57000000,
    "ratingAvg": 4.4,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 1500000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 10000000 },
      { "name": "5 star", "count": 38500000 }
    ]
  }
]
